[
  { "q": "What has to be broken before you can use it?", "a": "An egg" },
  { "q": "I’m tall when I’m young, and short when I’m old. What am I?", "a": "A candle" },
  { "q": "What month of the year has 28 days?", "a": "All of them" },
  { "q": "What is full of holes but still holds water?", "a": "A sponge" },
  { "q": "What question can you never answer yes to?", "a": "Are you asleep yet?" },
  { "q": "What is always in front of you but can’t be seen?", "a": "The future" },
  { "q": "There’s a one-story house where everything is yellow. The walls are yellow, the doors are yellow, even the furniture is yellow. What color are the stairs?", "a": "There aren’t any" },
  { "q": "What can you break, even if you never pick it up or touch it?", "a": "A promise" },
  { "q": "What goes up but never comes down?", "a": "Your age" },
  { "q": "A man who was outside in the rain without an umbrella or hat didn’t get a single hair on his head wet. Why?", "a": "He was bald" },

  { "q": "What gets wet while drying?", "a": "A towel" },
  { "q": "What can you keep after giving to someone?", "a": "Your word" },
  { "q": "I shave every day, but my beard stays the same. Who am I?", "a": "A barber" },
  { "q": "You see me once in June, twice in November, and not at all in May. What am I?", "a": "The letter e" },
  { "q": "What begins with T, ends with T, and has T in it?", "a": "A teapot" },
  { "q": "What has many keys but can’t open a single lock?", "a": "A piano" },
  { "q": "What can travel all around the world without leaving its corner?", "a": "A stamp" },
  { "q": "What has one eye but can’t see?", "a": "A needle" },
  { "q": "What has lots of eyes, but can’t see?", "a": "A potato" },
  { "q": "What has hands, but can’t clap?", "a": "A clock" },

  { "q": "What has legs, but doesn’t walk?", "a": "A table" },
  { "q": "What runs but never walks, has a mouth but never talks?", "a": "A river" },
  { "q": "What can you catch, but not throw?", "a": "A cold" },
  { "q": "What goes through cities and fields, but never moves?", "a": "A road" },
  { "q": "What can fill a room but takes up no space?", "a": "Light" },
  { "q": "The more of me you take, the more you leave behind. What am I?", "a": "Footsteps" },
  { "q": "The more of this you take, the more you leave behind. What is it?", "a": "Time" },
  { "q": "I’m easy to lift but hard to throw. What am I?", "a": "A feather" },
  { "q": "I’m lighter than a feather, but the strongest person can’t hold me for more than 5 minutes. What am I?", "a": "Your breath" },
  { "q": "What has a head, a tail, but no body?", "a": "A coin" },

  { "q": "What kind of coat is best put on wet?", "a": "A coat of paint" },
  { "q": "What invention lets you look right through a wall?", "a": "A window" },
  { "q": "What comes down but never goes up?", "a": "Rain" },
  { "q": "What has an ear but cannot hear?", "a": "Corn" },
  { "q": "The more you take away from me, the bigger I get. What am I?", "a": "A hole" },
  { "q": "What is always coming but never arrives?", "a": "Tomorrow" },
  { "q": "What belongs to you, but is used more by others?", "a": "Your name" },
  { "q": "The more you take away, the more I become. What am I?", "a": "A hole" },
  { "q": "What goes up and down but doesn’t move?", "a": "Stairs" },
  { "q": "What gets bigger when you take away from it?", "a": "A hole" },

  { "q": "What begins with an E, but only has one letter?", "a": "An envelope" },
  { "q": "What has words, but never speaks?", "a": "A book" },
  { "q": "What has a thumb and four fingers, but is not alive?", "a": "A glove" },
  { "q": "What kind of band never plays music?", "a": "A rubber band" },
  { "q": "What has a bottom at the top?", "a": "Your legs" },
  { "q": "What type of cheese is made backward?", "a": "Edam" },
  { "q": "What building has the most stories?", "a": "A library" },
  { "q": "What can run but not walk, has a mouth but cannot talk?", "a": "A river" },
  { "q": "What kind of tree can you carry in your hand?", "a": "A palm" },
  { "q": "What comes once in a minute, twice in a moment, but never in a thousand years?", "a": "The letter m" },

  { "q": "What gets sharper the more you use it?", "a": "Your brain" },
  { "q": "What goes up but never comes down?", "a": "Age" },
  { "q": "What has four wheels and flies?", "a": "A garbage truck" },
  { "q": "What has teeth but cannot bite?", "a": "A comb" },
  { "q": "What is black when you buy it, red when you use it, and gray when you throw it away?", "a": "Charcoal" },
  { "q": "What begins with P, ends with E, and has thousands of letters?", "a": "Post office" },
  { "q": "What has cities but no houses, forests but no trees, and rivers but no water?", "a": "A map" },
  { "q": "What has an end but no beginning, a home but no family, and a space without a room?", "a": "A road" },
  { "q": "What is so fragile that saying its name breaks it?", "a": "Silence" },
  { "q": "What has a bed but never sleeps?", "a": "A river" }
]
